# SetElementIds Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
Selection..::..SetElementIds Method
Selection Class See Also
---
Selects the elements.
**Namespace:** Autodesk.Revit.UI.Selection**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void SetElementIds(
	ICollection<ElementId> elementIds
)
```

Visual Basic
---
```text
Public Sub SetElementIds ( _
	elementIds As ICollection(Of ElementId) _
)
```

Visual C++
---
```text
public:
void SetElementIds(
	ICollection<ElementId^>^ elementIds
)
```

# ### Parameters
elementIds
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> The ids of the elements to be selected.
# Remarks
This function will select the specified elements and update the UI.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Selection Class
Autodesk.Revit.UI.Selection Namespace